'''
本文件用于定义全局变量
'''
#物品
# 必需品
need1=['A','B','C','D']
# 非必需品
need2 = []#'a','b','c','d']
need = need1 + need2
产品列表 = need
# 配方
pf=[
{'B':5},
{'C':5},
{'D':5},
{'B':5},
{'B':5},
{'B':5},
{'B':5},
{'B':5},
{'B':5},
{'B':5}
]

################################################
### 常量 ###################################
n = len(产品列表)

################################################
### 全局变量 ###################################
单位列表 =[]
buy ={} # 今日购买
out = {}
momeny ={}
price = {}
units=[]
store={}       # 总库存
信息表=[['名称','类型','储量','产量','人工','今日价格','购买花费','今日产值','出售','净利润','资金','净资产']]
for i in 产品列表:
    buy.update({i:0})
    out.update({i:0})
    momeny.update({i:0})
    price.update({i:0})
    store.update({i:0})

